app/Http/Controllers/ContactFormController.php

select `id`, `your_name`, `title`, `created_at` from `contact_forms`
---
  public function index()
  {
    // エロクアント ORマッパー
    // $contacts = ContactForm::all();

    // クエリビルダ
    $contacts = DB::table('contact_forms')
    ->select('id', 'your_name', 'title', 'created_at')
    ->get();

insert into `contact_forms` (`your_name`, `title`, `email`, `url`, `gender`, `age`, `contact`, `updated_at`, `created_at`) values ('dddd2222', 'dddd', 'sss@ddd.com', 'http://aaa.com', '0', '4', 'sss', '2020-04-22 17:33:23', '2020-04-22 17:33:23')
---
  public function store(Request $request)
  {
    $contact = new ContactForm;
    //
    $contact->your_name = $request->input('your_name');
    $contact->title = $request->input('title');
    $contact->email = $request->input('email');
    $contact->url = $request->input('url');
    $contact->gender = $request->input('gender');
    $contact->age = $request->input('age');
    $contact->contact = $request->input('contact');

    $contact->save();