app/Http/Controllers/ContactFormController.php

  public function destroy($id)
  {
    //
    $contact = ContactForm::find($id);

    $contact->delete();
---
delete from `contact_forms` where `id` = 3