app/Http/Controllers/TestController.php

    public function index(){

        $users = DB::table('tests')
        ->select('id')
        ->get();
        // dd($users);


        $values = Test::all();
---
select `id` from `tests`
select * from `tests`